; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v2)
             (pred_2 ?v10 ?v8)
             (pred_5 ?v9 ?v8)
             (pred_1 ?v7 ?v9 )
	     (pred_8 ?v9)
             (pred_3 ?v3)
             (pred_10 ?v10)
             (pred_7 ?v8)
             (pred_12 ?v9)
             (pred_4 ?v10)
             (pred_6 ?v9)
             (pred_9 ))



(:action op_3
:parameters (?v4 ?v6 ?v11 ?v13)
:precondition (and (pred_3 ?v4) (pred_3 ?v6) (pred_10 ?v11) (pred_7 ?v13)
          (pred_11 ?v4 ?v6) (pred_2 ?v11 ?v13)
                   (pred_5 ?v6 ?v13) (pred_8 ?v4) 
                   (pred_12 ?v6) (pred_4 ?v11))
:effect (and  (pred_6 ?v6) (not (pred_12 ?v6))))


(:action op_2
:parameters (?v4 ?v1)
:precondition (and (pred_3 ?v4) (pred_3 ?v1)
               (pred_8 ?v4) (pred_11 ?v4 ?v1) (pred_6 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_3 ?v4) (pred_10 ?v11) 
                  (pred_8 ?v4) (pred_1 ?v11 ?v4) (pred_9 ))
:effect (and (pred_4 ?v11)
   (not (pred_1 ?v11 ?v4)) (not (pred_9 ))))


(:action op_5
:parameters (?v4 ?v5 ?v12)
:precondition (and (pred_3 ?v4) (pred_10 ?v5) (pred_10 ?v12)
                  (pred_8 ?v4) (pred_4 ?v12) (pred_1 ?v5 ?v4))
:effect (and (pred_4 ?v5) (pred_1 ?v12 ?v4)
        (not (pred_4 ?v12)) (not (pred_1 ?v5 ?v4))))

(:action op_1
:parameters (?v4 ?v11)
:precondition (and (pred_3 ?v4) (pred_10 ?v11) 
                  (pred_8 ?v4) (pred_4 ?v11))
:effect (and (pred_9 ) (pred_1 ?v11 ?v4) (not (pred_4 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_17 obj_01 obj_06 obj_15 obj_24 obj_07 obj_28 obj_25 obj_18 obj_04 obj_05 obj_16 obj_20 obj_19 obj_29 obj_14 obj_26 obj_23 obj_08 obj_21 obj_12 obj_02 obj_22 obj_09
    obj_11 obj_13 obj_03
    obj_30 obj_10 obj_31
    )

    (:init
       (pred_9)

       (pred_3 obj_27)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_06)
       (pred_3 obj_15)
       (pred_3 obj_24)
       (pred_3 obj_07)
       (pred_3 obj_28)
       (pred_3 obj_25)
       (pred_3 obj_18)
       (pred_3 obj_04)
       (pred_3 obj_05)
       (pred_3 obj_16)
       (pred_3 obj_20)
       (pred_3 obj_19)
       (pred_3 obj_29)
       (pred_3 obj_14)
       (pred_3 obj_26)
       (pred_3 obj_23)
       (pred_3 obj_08)
       (pred_3 obj_21)
       (pred_3 obj_12)
       (pred_3 obj_02)
       (pred_3 obj_22)
       (pred_3 obj_09)
       (pred_7 obj_11)
       (pred_7 obj_13)
       (pred_7 obj_03)
       (pred_10 obj_30)
       (pred_10 obj_10)
       (pred_10 obj_31)

       (pred_11 obj_27 obj_24)
       (pred_11 obj_27 obj_17)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_01)
       (pred_11 obj_17 obj_27)
       (pred_11 obj_01 obj_28)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_17)
       (pred_11 obj_06 obj_25)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_15 obj_18)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_24 obj_04)
       (pred_11 obj_24 obj_07)
       (pred_11 obj_24 obj_27)
       (pred_11 obj_07 obj_05)
       (pred_11 obj_07 obj_28)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_24)
       (pred_11 obj_28 obj_16)
       (pred_11 obj_28 obj_25)
       (pred_11 obj_28 obj_01)
       (pred_11 obj_28 obj_07)
       (pred_11 obj_25 obj_20)
       (pred_11 obj_25 obj_18)
       (pred_11 obj_25 obj_06)
       (pred_11 obj_25 obj_28)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_15)
       (pred_11 obj_18 obj_25)
       (pred_11 obj_04 obj_29)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_24)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_07)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_16 obj_26)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_28)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_20 obj_23)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_25)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_29 obj_21)
       (pred_11 obj_29 obj_14)
       (pred_11 obj_29 obj_04)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_26)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_14 obj_29)
       (pred_11 obj_26 obj_02)
       (pred_11 obj_26 obj_23)
       (pred_11 obj_26 obj_16)
       (pred_11 obj_26 obj_14)
       (pred_11 obj_23 obj_22)
       (pred_11 obj_23 obj_08)
       (pred_11 obj_23 obj_20)
       (pred_11 obj_23 obj_26)
       (pred_11 obj_08 obj_09)
       (pred_11 obj_08 obj_19)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_21 obj_29)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_02 obj_26)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_22 obj_09)
       (pred_11 obj_22 obj_23)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_09 obj_22)
       (pred_12 obj_12)
       (pred_12 obj_08)
       (pred_12 obj_15)
       (pred_5  obj_12 obj_11)
       (pred_5  obj_08 obj_13)
       (pred_5  obj_15 obj_03)
       (pred_6 obj_27)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_06)
       (pred_6 obj_24)
       (pred_6 obj_07)
       (pred_6 obj_28)
       (pred_6 obj_25)
       (pred_6 obj_18)
       (pred_6 obj_04)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_19)
       (pred_6 obj_29)
       (pred_6 obj_14)
       (pred_6 obj_26)
       (pred_6 obj_23)
       (pred_6 obj_21)
       (pred_6 obj_02)
       (pred_6 obj_22)
       (pred_6 obj_09)

       (pred_2  obj_30 obj_11)
       (pred_2  obj_10 obj_13)
       (pred_2  obj_31 obj_03)
       (pred_1 obj_30 obj_19)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_31 obj_18)
       (pred_8 obj_24)
    )

    (:goal (and
       (pred_1 obj_10 obj_27)
       (pred_1 obj_31 obj_14)
    ))
(:constraints
  (always (not (pred_8 obj_25)))
)
)

; plan
1. (op_2 obj_24 obj_07)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_07)
   goals met: 0 of 2
2. (op_2 obj_07 obj_05)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_05)
   goals met: 0 of 2
3. (op_2 obj_05 obj_16)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_16)
   goals met: 0 of 2
4. (op_2 obj_16 obj_20)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_20)
   goals met: 0 of 2
5. (op_2 obj_20 obj_19)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_19)
   goals met: 0 of 2
6. (op_2 obj_19 obj_18)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_18)
   goals met: 0 of 2
7. (op_4 obj_18 obj_31)
   deleted: (pred_1 obj_31 obj_18) (pred_9)
   added: (pred_4 obj_31)
   goals met: 0 of 2
8. (op_2 obj_18 obj_19)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_19)
   goals met: 0 of 2
9. (op_2 obj_19 obj_20)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_20)
   goals met: 0 of 2
10. (op_2 obj_20 obj_16)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_16)
   goals met: 0 of 2
11. (op_2 obj_16 obj_05)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_05)
   goals met: 0 of 2
12. (op_2 obj_05 obj_14)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_14)
   goals met: 0 of 2
13. (op_1 obj_14 obj_31)
   deleted: (pred_4 obj_31)
   added: (pred_9) (pred_1 obj_31 obj_14)
   goals met: 1 of 2
14. (op_2 obj_14 obj_26)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_26)
   goals met: 1 of 2
15. (op_2 obj_26 obj_16)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_16)
   goals met: 1 of 2
16. (op_2 obj_16 obj_20)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_20)
   goals met: 1 of 2
17. (op_2 obj_20 obj_19)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_19)
   goals met: 1 of 2
18. (op_2 obj_19 obj_18)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_18)
   goals met: 1 of 2
19. (op_4 obj_18 obj_10)
   deleted: (pred_1 obj_10 obj_18) (pred_9)
   added: (pred_4 obj_10)
   goals met: 1 of 2
20. (op_2 obj_18 obj_19)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_19)
   goals met: 1 of 2
21. (op_2 obj_19 obj_20)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_20)
   goals met: 1 of 2
22. (op_2 obj_20 obj_16)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_16)
   goals met: 1 of 2
23. (op_2 obj_16 obj_28)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_28)
   goals met: 1 of 2
24. (op_2 obj_28 obj_01)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_01)
   goals met: 1 of 2
25. (op_2 obj_01 obj_17)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_17)
   goals met: 1 of 2
26. (op_2 obj_17 obj_27)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_27)
   goals met: 1 of 2
27. (op_1 obj_27 obj_10)
   deleted: (pred_4 obj_10)
   added: (pred_9) (pred_1 obj_10 obj_27)
   goals met: 2 of 2
